Tekla Open API Reference for Tekla Structures 2025
Vector.Cross Method (Vector, Vector)
 Returns a new cross product vector of the given two vectors.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Vector Cross(
	Vector Vector1,
	Vector Vector2
)
Public Shared Function Cross (
	Vector1 As Vector,
	Vector2 As Vector
) As Vector
Parameters
Vector1
Type: Tekla.Structures.Geometry3d.Vector
The first vector to be used.
Vector2
Type: Tekla.Structures.Geometry3d.Vector
The second vector to be used.
Return Value
Type: Vector
The new cross product vector.
See Also
Reference
Vector Class
Cross Overload
Tekla.Structures.Geometry3d Namespace